## Encoding Features for Machine Learning using df_clean

In [57]:
# Importing dependencies
import pandas as pd
import numpy as np
%matplotlib inline

import warnings
warnings.simplefilter('ignore')

In [58]:
# Loading files 

gender_to_load= ("resources/train.csv")
gender_data= pd.read_csv(gender_to_load)

test_to_load= ("resources/test.csv")
test_data= pd.read_csv(test_to_load)

train_to_load= ("resources/train.csv")
train_data= pd.read_csv(train_to_load)
train_data.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [50]:
train_data.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [51]:
gender_data.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [52]:
# Droping empty values
test_df= test_data.dropna(subset=["SibSp","Parch", "Embarked", "Sex", "Name","Age", "Ticket", "Fare"])
test_df.head(5)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [63]:
# Creating new dataframe for ML process - selecting features -

features_ml= test_df[["Sex","Age","Pclass","Fare","Embarked"]].copy()
features_ml.head(5)

# Filling missing values from Categorical Data
features_ml['Embarked'].fillna(features_ml['Embarked'].value_counts().index[0],inplace=True)
features_ml

        Sex   Age  Pclass      Fare Embarked
0      male  34.5       3    7.8292        Q
1    female  47.0       3    7.0000        S
2      male  62.0       2    9.6875        Q
3      male  27.0       3    8.6625        S
4    female  22.0       3   12.2875        S
..      ...   ...     ...       ...      ...
409  female   3.0       3   13.7750        S
411  female  37.0       1   90.0000        Q
412  female  28.0       3    7.7750        S
414  female  39.0       1  108.9000        C
415    male  38.5       3    7.2500        S

[331 rows x 5 columns]

In [54]:
# Target - we want to know the values of survivors
target= survivors

##  target = features_ml.survived.values
titanic_ml= features_ml[['']]

## Starting Preprocessing

In [55]:
from sklearn.preprocessing import StandardScaler, OneHotEncoder
from sklearn.compose import ColumnTransformer, make_column_transformer

In [56]:
## Transforming the categorical variables into numerical ones

    #1. Check the values of the features we have
features_ml.dtypes

Sex          object
Age         float64
Pclass        int64
Fare        float64
Embarked     object
dtype: object

In [42]:
    #2. Using column transformers
    
preprocessing= make_column_transformer(
    (["Age", "Fare"],StandardScaler()),
    (["Sex","Embarked","Pclass"],OneHotEncoder())
)
    
preprocessing

ColumnTransformer(transformers=[('list-1', ['Age', 'Fare'], StandardScaler()),
                                ('list-2', ['Sex', 'Embarked', 'Pclass'],
                                 OneHotEncoder())])

In [43]:
preprocessing

ColumnTransformer(transformers=[('list-1', ['Age', 'Fare'], StandardScaler()),
                                ('list-2', ['Sex', 'Embarked', 'Pclass'],
                                 OneHotEncoder())])